zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_dcmipp.h
  * @author  MCD Application Team
  * @brief   Header file of DCMIPP HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_HAL_DCMIPP_H
#define __STM32MP2xx_HAL_DCMIPP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

#if defined (DCMIPP)

/** @addtogroup DCMIPP DCMIPP
  * @brief DCMIPP HAL module driver
  * @{
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup DCMIPP_Exported_Types DCMIPP Exported Types
  * @brief    DCMIPP Exported Types
  * @{
  */
#if defined(DCMIPP_CSI2_SUPPORT)
#define MAX_DATATYPE_NB  7U  /*!< DCMIPP CSI maximum number of data types  */
#endif /* DCMIPP_CSI2_SUPPORT */

/**
  * @brief   DCMIPP Embedded Synchronisation Unmask codes structure definition
  */
typedef struct
{
  uint8_t FrameStartUnmask; /*!< Specifies the frame start delimiter unmask. */
  uint8_t LineStartUnmask;  /*!< Specifies the line start delimiter unmask.  */
  uint8_t LineEndUnmask;    /*!< Specifies the line end delimiter unmask.    */
  uint8_t FrameEndUnmask;   /*!< Specifies the frame end delimiter unmask.   */
} DCMIPP_EmbeddedSyncUnmaskTypeDef;

/**
  * @brief   DCMIPP Embedded Synchronisation codes structure definition (CCIR656)
  */
typedef struct
{
  uint8_t FrameStartCode;  /*!< Specifies the code of the frame start delimiter. */
  uint8_t LineStartCode;   /*!< Specifies the code of the line start delimiter.  */
  uint8_t LineEndCode;     /*!< Specifies the code of the line end delimiter.    */
  uint8_t FrameEndCode;    /*!< Specifies the code of the frame end delimiter.   */
} DCMIPP_EmbeddedSyncCodesTypeDef;

#if defined(DCMIPP_CSI2_SUPPORT)
/**
  * @brief  HAL DCMIPP CSI PIPE configuration structure definition
  */
typedef struct
{
  uint32_t DataTypeMode ; /*!< Configures the Data Type Mode
                               This parameter can be a value from @ref DCMIPP_DataTypeMode    */
  uint32_t DataTypeIDA ;  /*!< Configures the Data type selection ID-A
                               This parameter can be a value from @ref DCMIPP_DataType        */
  uint32_t DataTypeIDB ;  /*!< Configures the Data type selection ID-B
                               This parameter can be a value from @ref DCMIPP_DataType        */
} DCMIPP_CSI_PIPE_ConfTypeDef;
/**
  * @brief  HAL DCMIPP CSI configuration structure definition
  */
typedef struct
{
  uint32_t NumberOfLanes;     /*!< Configures the Number of Lanes
                                   This parameter can be a value from @ref DCMIPP_CSI_Number_Of_Lanes */
  uint32_t DataLaneMapping;   /*!< Configures the Data Lane Mapping
                                   This parameter can be a value from @ref DCMIPP_CSI_DataLaneMapping */
  uint32_t PHYBitrate;        /*!< Configures the Phy Bitrate
                                   This parameter can be a value from @ref DCMIPP_CSI_PHY_BitRate     */
} DCMIPP_CSI_ConfTypeDef;
/**
  * @brief  HAL DCMIPP CSI Virtual Channel Filtering configuration structure definition
  */
typedef struct
{
  uint32_t DataTypeNB;                        /*!< Configures the Data Type number
                                                   This parameter can be a value from @ref DCMIPP_CSI_DataTypeID     */
  uint32_t DataTypeClass[MAX_DATATYPE_NB];    /*!< Configures the Data Type Class
                                                   This parameter can be a value between 0 and 63                    */
  uint32_t DataTypeFormat[MAX_DATATYPE_NB];   /*!< Configures the Data Type Class
                                                   This parameter can be a value from @ref DCMIPP_CSI_DataTypeFormat */
} DCMIPP_CSI_VCFilteringConfTypeDef;

/**
  * @brief  HAL DCMIPP CSI Timer configuration structure definition
  */
typedef struct
{
  uint32_t VirtualChannel;       /*!< The Virtual Channel ID
                                      This parameter can be a value from @ref DCMIPP_Virtual_Channel      */
  uint32_t StartPoint;           /*!< The Start Point of the counter
                                      This parameter can be a value from @ref DCMIPP_CSI_Timer_StartPoint */
  uint32_t Count;                /*!< Number of clock cycle to count from the start point
                                      This parameter can be a value between 0 and 0x1FFFFFF               */
} DCMIPP_CSI_TimerConfTypeDef;
/**
  * @brief  HAL DCMIPP CSI LineByte Counter configuration structure definition
  */
typedef struct
{
  uint32_t VirtualChannel;   /*!< Configures the Virtual Channel ID
                                  This parameter can be a value from @ref DCMIPP_Virtual_Channel */
  uint32_t LineCounter;      /*!< Configures the Line Number
                                  This parameter can be a value between 0 and 65535              */
  uint32_t ByteCounter;      /*!< Configures the Byte Number
                                  This parameter can be a value between 0 and 65535              */
} DCMIPP_CSI_LineByteCounterConfTypeDef;
#endif /* DCMIPP_CSI2_SUPPORT */

/**
  * @brief  HAL DCMIPP Parallel configuration structure definition
  */
typedef struct
{
  uint32_t  Format;                             /*!< Configures the DCMIPP Format
                                                  This parameter can be one value of @ref DCMIPP_Format              */
  uint32_t  VSPolarity;                         /*!< Specifies the Vertical synchronization polarity: High or Low.
                                                  This parameter can be a value of @ref DCMIPP_VSYNC_Polarity        */
  uint32_t  HSPolarity;                         /*!< Specifies the Horizontal synchronization polarity: High or Low.
                                                  This parameter can be a value of @ref DCMIPP_HSYNC_Polarity        */
  uint32_t  PCKPolarity;                        /*!< Specifies the Pixel clock polarity: Falling or Rising.
                                                  This parameter can be a value of @ref DCMIPP_PIXCK_Polarity        */
  uint32_t  ExtendedDataMode ;                  /*!< Specifies the data width: 8-bit, 10-bit, 12-bit 14-bit or 16-bits.
                                                  This parameter can be a value of @ref DCMIPP_Extended_Data_Mode    */
  uint32_t  SynchroMode;                        /*!< Specifies the Synchronization Mode: Hardware or Embedded.
                                                  This parameter can be a value of @ref DCMIPP_Synchronization_Mode  */
  DCMIPP_EmbeddedSyncCodesTypeDef SynchroCodes; /*!< Specifies the code of the line/frame start delimiter and the
                                                  line/frame end delimiter                                           */
  uint32_t  SwapBits;                           /*!< Enable or Disable the Swap Bits.
                                                  This parameter can be a value of @ref DCMIPP_SWAP_BITS             */
  uint32_t  SwapCycles;                         /*!<  Enable or Disable the Swap Cycles.
                                                  This parameter can be a value of @ref DCMIPP_SWAP_CYCLES           */
} DCMIPP_ParallelConfTypeDef;

/**
  * @brief  HAL DCMIPP Test Pattern Generator configuration structure definition
  */
typedef struct
{
  uint32_t Width;                                /*!< Configures the width of the visible pixels of generated frame.
                                                      This parameter can be one value between 16 and 16383.           */
  uint32_t Height;                               /*!< Configures the height of the visible pixels of generated frame.
                                                      This parameter can be one value up to 16383.                    */
  uint32_t VBL;                                  /*!< Configures the amount of lines of the vertical blanking.
                                                      This parameter can be one value between 16 and 65535.           */
  uint32_t Format;                               /*!< Configures the TPG pixel format.
                                                      This parameter can be a value of @ref DCMIPP_TPG_Format         */
  uint32_t RawBayerType;                         /*!< Configures the RAW Bayer type. It is required when Format is Raw.
                                                      This parameter can be a value of @ref DCMIPP_TPG_Raw_Bayer_Type */
  uint32_t YUVType;                              /*!< Configure the YUV type. It is required when Format is YUV.
                                                      This parameter can be a value of @ref DCMIPP_TPG_YUV_Type       */
  uint32_t Pattern;                              /*!< Configure the pattern of the TPG frames.
                                                      This parameter can be a value of @ref DCMIPP_TPG_Pattern        */
  uint32_t GreyScale;                            /*!< Enables or disable the Grey Scale.
                                                      This parameter can be a value of @ref DCMIPP_TPG_Grey_Scale     */
  uint32_t Lifeline;                             /*!< Enables or disable lifeline on TPG frames.
                                                      This parameter can be a value of @ref DCMIPP_TPG_Lifeline       */
} DCMIPP_TPGConfTypeDef;

/**
  * @brief  HAL DCMIPP Pipe configuration structure definition
  */
typedef struct
{
  uint32_t FrameRate;         /*!< Configures the DCMIPP Pipe Frame Rate
                                   This parameter can be one value of @ref DCMIPP_Frame_Rates           */
  uint32_t PixelPipePitch;    /*!< Configures the DCMIPP Pixel Pipe Pitch
                                   This parameter can be one value from                                 */
  uint32_t PixelPackerFormat; /*!< Configures the DCMIPP Pixel Pipe Format
                                   This parameter can be one value from @ref DCMIPP_Pixel_Packer_Format */
} DCMIPP_PipeConfTypeDef;

/**
  * @brief  HAL DCMIPP IPPLUG configuration structure definition
  */
typedef struct
{
  uint32_t Client;                      /*!< Configures the DCMIPP IPPLUG Client
                                             This parameter can be a value from @ref DCMIPP_IPPLUG_Client      */
  uint32_t MemoryPageSize;              /*!< Configures the DCMIPP IPPLUG Memory page size
                                             This parameter can be a value from @ref DCMIPP_Memory_Page_Size   */
  uint32_t Traffic;                     /*!< Configures the DCMIPP IPPLUG Traffic
                                             This parameter can be a value from @ref DCMIPP_Traffic_Burst_Size */
  uint32_t MaxOutstandingTransactions ; /*!< Configures the DCMIPP IPPLUG Maximum outstanding transactions
                                             This parameter can be a value from
                                             DCMIPP_Maximum_Outstanding_Transactions                           */
  uint32_t DPREGStart;                  /*!< Configures the End word of the FIFO of Clientx
                                             This parameter can be a value between 0 and  0x3FF                */
  uint32_t DPREGEnd;                    /*!< Configures the Start word of the FIFO of Clientx
                                             This parameter can be a value between 0 and  0x3FF                */
  uint32_t WLRURatio;                   /*!< Configures the DCMIPP Ratio for WLRU arbitration
                                             This parameter can be a value between 0 and 15                    */
} DCMIPP_IPPlugConfTypeDef;

/**
  * @brief  HAL DCMIPP Crop configuration structure definition
  */
typedef struct
{
  uint32_t VStart;   /*!< Configures the DCMIPP Crop Vertical Start
                          This parameter can be one value between 0 and 4095          */
  uint32_t HStart;   /*!< Configures the DCMIPP Crop Horizontal Start
                          This parameter can be one value between 0 and 4095          */
  uint32_t VSize;    /*!< Configures the DCMIPP Crop Vertical Size
                          This parameter can be one value between 0 and 4095          */
  uint32_t HSize;    /*!< Configures the DCMIPP Crop Horizontal Size
                          This parameter can be one value between 1 and 4095          */
  uint32_t PipeArea; /*!< Configures the DCMIPP Crop Area for the pipe0
                          This parameter can be one value of @ref DCMIPP_Crop_Area    */
} DCMIPP_CropConfTypeDef;

typedef struct
{
  uint32_t VStart;    /*!< Configures the DCMIPP Statistic Extraction Vertical Start
                           This parameter can be one value between 0 and 4095                     */
  uint32_t HStart;    /*!< Configures the DCMIPP Statistic Extraction Horizontal Start
                           This parameter can be one value between 0 and 4095                     */
  uint32_t VSize;     /*!< Configures the DCMIPP Statistic Extraction Vertical Size
                           This parameter can be one value between 0 and 4095                     */
  uint32_t HSize;     /*!< Configures the DCMIPP Statistic Extraction Horizontal Size
                           This parameter can be one value between 0 and 4095                     */
} DCMIPP_StatisticExtractionAreaConfTypeDef;

typedef struct
{
  uint32_t Mode;      /*!< Configures the DCMIPP Statistic Extraction Mode
                           This parameter can be a value from @ref DCMIPP_Statistics_Extraction_Mode   */
  uint32_t Source;    /*!< Configures the DCMIPP Statistic Extraction Source
                           This parameter can be a value from @ref DCMIPP_Statistics_Extraction_Source */
  uint32_t Bins;      /*!< Configures the DCMIPP Statistic Extraction Bins
                           This parameter can be a value from @ref DCMIPP_Statistics_Extraction_Bins   */
} DCMIPP_StatisticExtractionConfTypeDef;


typedef struct
{
  uint8_t ShiftRed;        /*!< Configures the DCMIPP Exposure Shift Red
                                This parameter can be one value between 0 and 7    */
  uint8_t MultiplierRed;   /*!< Configures the DCMIPP Exposure Multiplier Red
                                This parameter can be one value between 0 and 127 */
  uint8_t ShiftGreen;      /*!< Configures the DCMIPP Exposure Shift Green
                                This parameter can be one value between 0 and 7    */
  uint8_t MultiplierGreen; /*!< Configures the DCMIPP Exposure Multiplier Green
                                This parameter can be one value between 0 and 127 */
  uint8_t ShiftBlue;       /*!< Configures the DCMIPP Exposure Shift Blue
                                This parameter can be one value between 0 and 7    */
  uint8_t MultiplierBlue;  /*!< Configures the DCMIPP Exposure Multiplier Blue
                                This parameter can be one value between 0 and 127 */
} DCMIPP_ExposureConfTypeDef;

typedef struct
{
  uint8_t LUM_0;    /*!< Luminance increase for input luminance of 0
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_32;   /*!< Luminance increase for input luminance of 32
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_64;   /*!< Luminance increase for input luminance of 64
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_96;   /*!< Luminance increase for input luminance of 96
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_128;  /*!< Luminance increase for input luminance of 128
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_160;  /*!< Luminance increase for input luminance of 160
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_192;  /*!< Luminance increase for input luminance of 192
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_224;  /*!< Luminance increase for input luminance of 224
                         This parameter can be one value between 0 and 31 */
  uint8_t LUM_256;  /*!< Luminance increase for input luminance of 256
                         This parameter can be one value between 0 and 31 */
} DCMIPP_ContrastConfTypeDef;

typedef struct
{
  uint32_t VLineStrength;  /*!< Strength of the vertical line detection
                                This parameter can be a value from @ref DCMIPP_RAWBayer2RGB_Strength */
  uint32_t HLineStrength;  /*!< Strength of the horizontal line detection
                                This parameter can be a value from @ref DCMIPP_RAWBayer2RGB_Strength */
  uint32_t RawBayerType;   /*!< Raw Bayer type
                                This parameter can be a value from @ref DCMIPP_RAWBayer2RGB_Type     */
  uint32_t PeakStrength;   /*!< Strength of the peak detection
                                This parameter can be a value from @ref DCMIPP_RAWBayer2RGB_Strength */
  uint32_t EdgeStrength;   /*!< Strength of the edge detection
                                This parameter can be a value from @ref DCMIPP_RAWBayer2RGB_Strength */
} DCMIPP_RawBayer2RGBConfTypeDef;

/**
   * @brief  Color Conversion parameters
   */
typedef struct
{
  uint8_t ClampOutputSamples;  /*!< Clamp the output samples depending on type
                                    This parameter can be ENABLE or DISABLE */
  uint8_t OutputSamplesType;   /*!< Output samples type used while clamp is activated
                                    This parameter can be a value from @ref DCMIPP_OutputSamplesType */
  int16_t RR;                  /*!< Coefficient Row 1 Column 1 of the matrix
                                    This parameter can be a value from -1023 to 1023 */
  int16_t RG;                  /*!< Coefficient Row 1 Column 2 of the matrix
                                    This parameter can be a value from -1023 to 1023 */
  int16_t RB;                  /*!< Coefficient Row 1 Column 3 of the matrix
                                    This parameter can be a value from -511 to 511   */
  int16_t RA;                  /*!< Coefficient Row 1 of the added Column
                                    This parameter can be a value from -511 to 511   */
  int16_t GR;                  /*!< Coefficient Row 2 Column 1 of the matrix
                                    This parameter can be a value from -1023 to 1023 */
  int16_t GG;                  /*!< Coefficient Row 2 Column 2 of the matrix
                                    This parameter can be a value from -1023 to 1023 */
  int16_t GB;                  /*!< Coefficient Row 2 Column 3 of the matrix
                                    This parameter can be a value from -511 to 511   */
  int16_t GA;                  /*!< Coefficient Row 2 of the added Column
                                    This parameter can be a value from -511 to 511   */
  int16_t BR;                  /*!< Coefficient Row 3 Column 1 of the matrix
                                    This parameter can be a value from -1023 to 1023 */
  int16_t BG;                  /*!< Coefficient Row 3 Column 2 of the matrix
                                     This parameter can be a value -1023 to 1023     */
  int16_t BB;                  /*!< Coefficient Row 3 Column 3 of the matrix
                                    This parameter can be a value from -511 to 511   */
  int16_t BA;                  /*!< Coefficient Row 3 of the added Column
                                    This parameter can be a value from -511 to 511   */
} DCMIPP_ColorConversionConfTypeDef;

/**
   * @brief  Black Level parameters
   */
typedef struct
{
  uint8_t RedCompBlackLevel;    /*!< Black value register to red component
                                  This parameter can be one value between 0 and 255 */
  uint8_t GreenCompBlackLevel;  /*!< Black value register to green component
                                  This parameter can be one value between 0 and 255 */
  uint8_t BlueCompBlackLevel;   /*!< Black value register to blue component
                                  This parameter can be one value between 0 and 255 */
} DCMIPP_BlackLevelConfTypeDef;

/**
  * @brief  HAL DCMIPP
  */
typedef struct
{
  uint32_t VSize;       /*!< Configures the DCMIPP Downsize Vertical Size
                             This parameter can be one value between 0 and 4095     */
  uint32_t HSize;       /*!< Configures the DCMIPP Downsize Horizontal Size
                             This parameter can be one value between 0 and 4095     */
  uint32_t VRatio;      /*!< Configures the DCMIPP Downsize Vertical Ratio
                             This parameter can be one value between 0 and 4095     */
  uint32_t HRatio;      /*!< Configures the DCMIPP Downsize Horizontal Ratio
                             This parameter can be one value between 0 and 4095     */
  uint32_t VDivFactor;  /*!< Configures the DCMIPP Downsize Vertical Division Factor
                             This parameter can be one value between 0 and 4095     */
  uint32_t HDivFactor;  /*!< Configures the DCMIPP Downsize Horizontal Division Factor
                             This parameter can be one value between 0 and 4095     */
} DCMIPP_DownsizeTypeDef;

typedef struct
{
  uint32_t VRatio;  /*!< Configures the DCMIPP Downsize Vertical Size
                         This parameter can be  a value from @ref DCMIPP_PIPE_Vertical_Decimation_Ratio   */
  uint32_t HRatio;  /*!< Configures the DCMIPP Downsize Vertical Size
                         This parameter can be  a value from @ref DCMIPP_PIPE_Horizontal_Decimation_Ratio */
} DCMIPP_DecimationConfTypeDef;

#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
/**
  *  @brief  Histogram Configuration
  */

typedef struct
{
  uint32_t      Source;         /*!< Source for Histogram extraction
                                     This parameter can be a value from @ref DCMIPP_Histogram_Source                */
  uint32_t      Components;     /*!< components selection for Histograms
                                     This parameter can be a value from @ref DCMIPP_Histogram_Component_Selection   */
  uint32_t      PixelDynamic;   /*!< Dynamic of pixel value
                                     This parameter can be a value from @ref DCMIPP_Histogram_Dynamic               */
  uint32_t      Bin;            /*!< Bin amount per histogram
                                     This parameter can be a value from @ref DCMIPP_Histogram_Bins                  */
} DCMIPP_Histogram_ConfTypeDef;

