zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
/** @defgroup DCMIPP_Exported_Constants DCMIPP Exported Constants
  * @brief    DCMIPP Exported constants
  * @{
  */

/** @defgroup DCMIPP_Pipes DCMIPP Pipes
  * @{
  */
#define  DCMIPP_PIPE0      0U     /*!< DCMIPP Pipe0 (Dump pipe)       */
#define  DCMIPP_PIPE1      1U     /*!< DCMIPP Pipe1 (Main Pipe)       */
#define  DCMIPP_PIPE2      2U     /*!< DCMIPP Pipe2 (Ancillary pipe)  */
/**
  * @}
  */

/** @defgroup DCMIPP_Error_Codes DCMIPP Error Codes
  * @{
  */
#define HAL_DCMIPP_ERROR_NONE            (0x00000000U)             /*!< No error                  */
#define HAL_DCMIPP_ERROR_AXI_TRANSFER    (0x00000001U)             /*!< IPPLUG AXI Transfer error */
#define HAL_DCMIPP_ERROR_PARALLEL_SYNC   (0x00000002U)             /*!< Synchronization error     */
#define HAL_DCMIPP_ERROR_PIPE0_LIMIT     (0x00000004U)             /*!< Limit error on pipe0      */
#define HAL_DCMIPP_ERROR_PIPE0_OVR       (0x00000008U)             /*!< Overrun error on pipe0    */
#define HAL_DCMIPP_ERROR_PIPE1_OVR       (0x00000010U)             /*!< Overrun error on pipe1    */
#define HAL_DCMIPP_ERROR_PIPE2_OVR       (0x00000020U)             /*!< Overrun error on pipe2    */
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
#define HAL_DCMIPP_ERROR_PIPE1_HISTO_OVR    (0x00000040U)             /*!< Overrun error on pipe1 histogram    */
#define HAL_DCMIPP_ERROR_PIPE1_HISTO_BADCFG (0x00000080U)             /*!< Bad Config error on pipe1 histogram */
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */

#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS == 1)
#define  HAL_DCMIPP_ERROR_INVALID_CALLBACK ((uint32_t)0x00000100U) /*!< Invalid Callback error  */
#endif /* USE_HAL_DCMIPP_REGISTER_CALLBACKS */
/**
  * @}
  */
#if defined(DCMIPP_CSI2_SUPPORT)
/** @defgroup DCMIPP_CSI_Error_Codes DCMIPP CSI Error Codes
  * @{
  */
#define HAL_DCMIPP_CSI_ERROR_NONE            (0x00000080U)       /*!< No error                               */
#define HAL_DCMIPP_CSI_ERROR_SYNC            (0x00000100U)       /*!< Synchronization error                  */
#define HAL_DCMIPP_CSI_ERROR_WDG             (0x00000200U)       /*!< Watchdog Error                         */
#define HAL_DCMIPP_CSI_ERROR_SPKT            (0x00000400U)       /*!< Shorter Packet than expected Error     */
#define HAL_DCMIPP_CSI_ERROR_DATA_ID         (0x00000800U)       /*!< Data ID Information Error              */
#define HAL_DCMIPP_CSI_ERROR_CECC            (0x00001000U)       /*!< Corrected ECC Error                    */
#define HAL_DCMIPP_CSI_ERROR_ECC             (0x00002000U)       /*!< ECC Error                              */
#define HAL_DCMIPP_CSI_ERROR_CRC             (0x00004000U)       /*!< CRC Error                              */
#define HAL_DCMIPP_CSI_ERROR_DPHY_CTRL       (0x00008000U)       /*!< Error Control on data line (0 OR 1)    */
#define HAL_DCMIPP_CSI_ERROR_DPHY_LP_SYNC    (0x00010000U)       /*!< Low-Power data transmssion Synchronisation
                                                                      Error on data line (0 OR 1)   */
#define HAL_DCMIPP_CSI_ERROR_DPHY_ESCAPE     (0x00020000U)       /*!< Escape Entry Error on data line (0 OR 1) */
#define HAL_DCMIPP_CSI_ERROR_SOT_SYNC        (0x00040000U)       /*!< SOT Synchronisation Error on data line(0 OR 1) */
#define HAL_DCMIPP_CSI_ERROR_SOT             (0x00080000U)       /*!< SOT Error on data line (0 OR 1)        */
#endif /* DCMIPP_CSI2_SUPPORT */
/**
  * @}
  */
/** @defgroup DCMIPP_Capture_Mode DCMIPP Capture Mode
  * @{
  */
#define  DCMIPP_MODE_CONTINUOUS   0U                      /*!< DCMIPP continuous mode (preview) */
#define  DCMIPP_MODE_SNAPSHOT     DCMIPP_P0FCTCR_CPTMODE  /*!< DCMIPP snapshot mode             */
/**
  * @}
  */
#if defined(DCMIPP_CSI2_SUPPORT)
/** @defgroup DCMIPP_modes DCMIPP modes
  * @brief  DCMIPP_modes (DCMI or CSI): modes are exclusive
  * @{
  */
#define  DCMIPP_PARALLEL_MODE   (0x00U << DCMIPP_CMCR_INSEL_Pos)  /*!< DCMIPP Parallel (DCMI) mode */
#define  DCMIPP_SERIAL_MODE     (0x01U << DCMIPP_CMCR_INSEL_Pos)  /*!< DCMIPP CSI mode             */
/**
  * @}
  */
#endif /* DCMIPP_CSI2_SUPPORT */


/** @defgroup DCMIPP_TPG_Format DCMIPP TPG Format
  * @{
  */
#define DCMIPP_TPG_FORMAT_YUV422     (0x1EUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format YUV422  */
#define DCMIPP_TPG_FORMAT_RGB565     (0x22UL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RGB565  */
#define DCMIPP_TPG_FORMAT_RGB888     (0x24UL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RGB888  */
#define DCMIPP_TPG_FORMAT_RAW8       (0x2AUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RAW8    */
#define DCMIPP_TPG_FORMAT_RAW10      (0x2BUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RAW10   */
#define DCMIPP_TPG_FORMAT_RAW12      (0x2CUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RAW12   */
#define DCMIPP_TPG_FORMAT_RAW14      (0x2DUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format RAW14   */
#define DCMIPP_TPG_FORMAT_MONO8      (0x4AUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format MONO 8-bits  */
#define DCMIPP_TPG_FORMAT_MONO10     (0x4BUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format MONO 10-bits */
#define DCMIPP_TPG_FORMAT_MONO12     (0x4CUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format MONO 12-bits */
#define DCMIPP_TPG_FORMAT_MONO14     (0x4DUL << DCMIPP_CMTPGCR2_FORMAT_Pos)  /*!< DCMIPP TPG Format MONO 14-bits */
/**
  * @}
  */

/** @defgroup DCMIPP_TPG_Raw_Bayer_Type DCMIPP TPG Raw Bayer Type
  * @{
  */
#define DCMIPP_TPG_RT_RGGB    (0U)                           /*!< RGGB  */
#define DCMIPP_TPG_RT_GRBG    (1U << DCMIPP_CMTPGCR2_RT_Pos) /*!< GRBG  */
#define DCMIPP_TPG_RT_GBRG    (2U << DCMIPP_CMTPGCR2_RT_Pos) /*!< GBRG  */
#define DCMIPP_TPG_RT_BGGR    (3U << DCMIPP_CMTPGCR2_RT_Pos) /*!< BGGR  */
/**
  * @}
  */

/** @defgroup DCMIPP_TPG_YUV_Type DCMIPP TPG YUV Type
  * @{
  */
#define DCMIPP_TPG_YT_BT601_FULL       (0U)                            /*!< BT.601 Full range     */
#define DCMIPP_TPG_YT_BT709_FULL       (1U << DCMIPP_CMTPGCR2_YT_Pos)  /*!< BT.709 Full range     */
#define DCMIPP_TPG_YT_BT601_REDUCED    (2U << DCMIPP_CMTPGCR2_YT_Pos)  /*!< BT.601 Reduced range  */
#define DCMIPP_TPG_YT_BT709_REDUCED    (3U << DCMIPP_CMTPGCR2_YT_Pos)  /*!< BT.709 Reduced range  */
/**
  * @}
  */

/** @defgroup DCMIPP_TPG_Pattern DCMIPP TPG Pattern
  * @{
  */
#define DCMIPP_TPG_PATTERN_SQUARE        (0U)                                 /*!< Color squares */
#define DCMIPP_TPG_PATTERN_COLORBAR      (1U << DCMIPP_CMTPGCR2_PATTERN_Pos)  /*!< Color bar     */
/**
  * @}
  */

/** @defgroup DCMIPP_TPG_Grey_Scale DCMIPP TPG Grey Scale
  * @{
  */
#define DCMIPP_TPG_GREY_SCALE_DISABLE    (0U)                             /*!< Disable Grey Scale */
#define DCMIPP_TPG_GREY_SCALE_ENABLE     (1U << DCMIPP_CMTPGCR2_GSEN_Pos) /*!< Enable Grey Scale */
/**
  * @}
  */

