zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
/** @defgroup DCMIPP_TPG_Lifeline   DCMIPP TPG Lifeline
  * @{
  */
#define DCMIPP_TPG_LIFELINE_DISABLE       (0U)                               /*!< Disable Life Line */
#define DCMIPP_TPG_LIFELINE_ENABLE        (1U << DCMIPP_CMTPGCR2_LFLEN_Pos)  /*!< Enable Life Line */
/**
  * @}
  */


/** @defgroup DCMIPP_IPPLUG_Client DCMIPP IPPLUG Client
  * @{
  */
#define DCMIPP_CLIENT1  1U /*!< Client 1 identifier */
#define DCMIPP_CLIENT2  2U /*!< Client 2 identifier */
#define DCMIPP_CLIENT3  3U /*!< Client 3 identifier */
#define DCMIPP_CLIENT4  4U /*!< Client 4 identifier */
#define DCMIPP_CLIENT5  5U /*!< Client 5 identifier */
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
#define DCMIPP_CLIENT6  6U /*!< Client 6 identifier */
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
/**
  * @}
  */

/** @defgroup DCMIPP_Traffic_Burst_Size DCMIPP Traffic Burst Size
  * @{
  */
#define DCMIPP_TRAFFIC_BURST_SIZE_8BYTES   0U                                   /*!< Traffic Burst size 8 Bytes   */
#define DCMIPP_TRAFFIC_BURST_SIZE_16BYTES  (0x01U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 16 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_32BYTES  (0x02U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 32 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_64BYTES  (0x03U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 64 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_128BYTES (0x04U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 128 Bytes */
/**
  * @}
  */

/** @defgroup DCMIPP_Memory_Page_Size DCMIPP Memory Page Size
  * @{
  */
#define DCMIPP_MEMORY_PAGE_SIZE_64BYTES  0U                                     /*!< Memory Page size 64 Bytes  */
#define DCMIPP_MEMORY_PAGE_SIZE_128BYTES (0x01U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 128 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_256BYTES (0x02U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 256 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_512BYTES (0x03U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 512 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_1KBYTES  (0x04U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 1 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_2KBYTES  (0x05U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 2 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_4KBYTES  (0x06U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 4 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_8KBYTES  (0x07U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 8 Bytes   */
/**
  * @}
  */
/** @defgroup DCMIPP_Maximum_Outstanding_Transactions DCMIPP Maximum Outstanding Transactions
  * @{
  */
#define DCMIPP_OUTSTANDING_TRANSACTION_NONE 0U    /*!< Nooutstanding transaction limitation*/
#define DCMIPP_OUTSTANDING_TRANSACTION_2    0x01U /*!< Two outstanding transactions        */
#define DCMIPP_OUTSTANDING_TRANSACTION_3    0x02U /*!< Three outstanding transactions      */
#define DCMIPP_OUTSTANDING_TRANSACTION_4    0x03U /*!< Four outstanding transactions       */
#define DCMIPP_OUTSTANDING_TRANSACTION_5    0x04U /*!< 5 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_6    0x05U /*!< 6 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_7    0x06U /*!< 7 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_8    0x07U /*!< 8 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_9    0x08U /*!< 9 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_10   0x09U /*!< 10 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_11   0x0AU /*!< 11 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_12   0x0BU /*!< 12 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_13   0x0CU /*!< 13 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_14   0x0DU /*!< 14 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_15   0x0EU /*!< 15 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_16   0x0FU /*!< 16 outstanding transactions         */
/**
  * @}
  */

/** @defgroup DCMIPP_Frame_Rates  DCMIPP Frame Rates
  * @{
  */
#define DCMIPP_FRAME_RATE_ALL       0U                               /*!< All frames captured     */
#define DCMIPP_FRAME_RATE_1_OVER_2  (1U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 2 captured */
#define DCMIPP_FRAME_RATE_1_OVER_4  (2U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 4 captured */
#define DCMIPP_FRAME_RATE_1_OVER_8  (3U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 8 captured */
/**
  * @}
  */

/** @defgroup DCMIPP_Crop_Area  DCMIPP Crop Area
  * @{
  */
#define DCMIPP_POSITIVE_AREA  0U                    /*!< Positive Area chosen for crop */
#define DCMIPP_NEGATIVE_AREA  DCMIPP_P0SCSZR_POSNEG /*!< Negative Area chosen for crop */
/**
  * @}
  */
#if defined(DCMIPP_CSI2_SUPPORT)
/** @defgroup DCMIPP_Virtual_Channel DCMIPP Virtual Channel
  * @{
  */
#define DCMIPP_VIRTUAL_CHANNEL0   0U /*!< DCMIPP Virtual Channel 0 */
#define DCMIPP_VIRTUAL_CHANNEL1   1U /*!< DCMIPP Virtual Channel 1 */
#define DCMIPP_VIRTUAL_CHANNEL2   2U /*!< DCMIPP Virtual Channel 2 */
#define DCMIPP_VIRTUAL_CHANNEL3   3U /*!< DCMIPP Virtual Channel 3 */
/**
  * @}
  */

/** @defgroup DCMIPP_DataTypeMode DCMIPP DCMIPP Data Type Mode
  * @{
  */
#define DCMIPP_DTMODE_DTIDA                (0UL << DCMIPP_P0FSCR_DTMODE_Pos) /*!< Only flow DTIDA from the selected VC
                                                                                 is forwarded in the pipe */
#define DCMIPP_DTMODE_DTIDA_OR_DTIDB       (1UL << DCMIPP_P0FSCR_DTMODE_Pos) /*!< Flows DTIDA and/or DTIDB from the
                                                                                selected VC are forwarded in the pipe */
#define DCMIPP_DTMODE_ALL_EXCEPT_DTIA_DTIB (2UL << DCMIPP_P0FSCR_DTMODE_Pos) /*!< All data types from the selected VC
                                                                                (except the DTIDA or DTIDB) are
                                                                                 forwarded in the pipe,
                                                                                 only for Pipe0 */
#define DCMIPP_DTMODE_ALL                  (3UL << DCMIPP_P0FSCR_DTMODE_Pos) /*!< All data types of the selected virtual
                                                                                 channel VC are forwarded in the pipe,
                                                                                 only for Pipe0 */
/**
  * @}
  */

/** @defgroup DCMIPP_DataTypeSelection DCMIPP Data Type Selection
  * @{
  */
#define DCMIPP_DTSELECT_IDA  DCMIPP_P0FSCR_DTIDA_Pos  /*!< Data type selection ID A */
#define DCMIPP_DTSELECT_IDB  DCMIPP_P0FSCR_DTIDB_Pos  /*!< Data type selection ID B */

/**
  * @}
  */

