zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
/** @defgroup DCMIPP_DataType DCMIPP  Data Type
  * @{
  */
#define DCMIPP_DT_YUV420_8   0x18U   /*!< DCMIPP Data Type YUV420 8bit  */
#define DCMIPP_DT_YUV420_10  0x19U   /*!< DCMIPP Data Type YUV420 8bit  */
#define DCMIPP_DT_YUV422_8   0x1EU   /*!< DCMIPP Data Type YUV422 8bit  */
#define DCMIPP_DT_YUV422_10  0x1FU   /*!< DCMIPP Data Type YUV422 10bit */
#define DCMIPP_DT_RGB444     0x20U   /*!< DCMIPP Data Type RGB444       */
#define DCMIPP_DT_RGB555     0x21U   /*!< DCMIPP Data Type RGB555       */
#define DCMIPP_DT_RGB565     0x22U   /*!< DCMIPP Data Type RGB565       */
#define DCMIPP_DT_RGB666     0x23U   /*!< DCMIPP Data Type RGB666       */
#define DCMIPP_DT_RGB888     0x24U   /*!< DCMIPP Data Type RGB888       */
#define DCMIPP_DT_RAW8       0x2AU   /*!< DCMIPP Data Type RawBayer8    */
#define DCMIPP_DT_RAW10      0x2BU   /*!< DCMIPP Data Type RawBayer10   */
#define DCMIPP_DT_RAW12      0x2CU   /*!< DCMIPP Data Type RawBayer12   */
#define DCMIPP_DT_RAW14      0x2DU   /*!< DCMIPP Data Type RawBayer14   */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_DataTypeID DCMIPP CSI Data Type ID
  * @{
  */
#define DCMIPP_CSI_DT1 1U  /*!< DCMIPP Data Type ID 1 */
#define DCMIPP_CSI_DT2 2U  /*!< DCMIPP Data Type ID 2 */
#define DCMIPP_CSI_DT3 3U  /*!< DCMIPP Data Type ID 3 */
#define DCMIPP_CSI_DT4 4U  /*!< DCMIPP Data Type ID 4 */
#define DCMIPP_CSI_DT5 5U  /*!< DCMIPP Data Type ID 5 */
#define DCMIPP_CSI_DT6 6U  /*!< DCMIPP Data Type ID 6 */
#define DCMIPP_CSI_DT7 7U  /*!< DCMIPP Data Type ID 7 */
/**
  * @}
  */

/** @defgroup DCMIPP_CSI_Number_Of_Lanes DCMIPP CSI Number Of Lanes
  * @{
  */
#define DCMIPP_CSI_ONE_DATA_LANE  (1UL << CSI_LMCFGR_LANENB_Pos) /*!< DCMIPP CSI One Data Lane */
#define DCMIPP_CSI_TWO_DATA_LANES (2UL << CSI_LMCFGR_LANENB_Pos) /*!< DCMIPP CSI 2 Data Lanes  */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_DataLaneMapping DCMIPP CSI Data Lane Mapping
  * @{
  */
#define DCMIPP_CSI_PHYSICAL_DATA_LANES   1U  /*!< Physical data lane 0 connected to logical data lane 0 and
                                                  Physical data lane 1 connected to logical data lane 1  */
#define DCMIPP_CSI_INVERTED_DATA_LANES   2U  /*!< Physical data lane 1 connected to logical data lane 0 and
                                                  Physical data lane 0 connected to logical data lane 1 */
/**
  * @}
  */

/** @defgroup DCMIPP_CSI_DataLane DCMIPP CSI Data Lane
  * @{
  */
#define DCMIPP_CSI_DATA_LANE0   1UL /*!< DCMIPP CSI Data Lane 0 */
#define DCMIPP_CSI_DATA_LANE1   2UL /*!< DCMIPP CSI Data Lane 1 */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_Timer_StartPoint DCMIPP CSI Timer StartPoint
  * @{
  */
#define DCMIPP_CSI_TIMER_START_SOF  0U /*!< DCMIPP CSI Start timer counter at Start Of Frame */
#define DCMIPP_CSI_TIMER_START_EOF  1U /*!< DCMIPP CSI Start timer counter at End Of Frame   */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_DataTypeFormat DCMIPP CSI Data Type Format
  * @{
  */
#define DCMIPP_CSI_DT_BPP6  0U  /*!< DCMIPP CSI Data Type Format 6 bit words */
#define DCMIPP_CSI_DT_BPP7  1U  /*!< DCMIPP CSI Data Type Format 7 bit words */
#define DCMIPP_CSI_DT_BPP8  2U  /*!< DCMIPP CSI Data Type Format 8 bit words */
#define DCMIPP_CSI_DT_BPP10 3U  /*!< DCMIPP CSI Data Type Format 10 bit words */
#define DCMIPP_CSI_DT_BPP12 4U  /*!< DCMIPP CSI Data Type Format 12 bit words */
#define DCMIPP_CSI_DT_BPP14 5U  /*!< DCMIPP CSI Data Type Format 14 bit words */
#define DCMIPP_CSI_DT_BPP16 6U  /*!< DCMIPP CSI Data Type Format 16 bit words */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_Timer DCMIPP CSI Timer
  * @{
  */
#define DCMIPP_CSI_TIMER0 0U     /*!< DCMIPP CSI Timer0 */
#define DCMIPP_CSI_TIMER1 1U  /*!< DCMIPP CSI Timer1 */
#define DCMIPP_CSI_TIMER2 2U  /*!< DCMIPP CSI Timer2 */
#define DCMIPP_CSI_TIMER3 3U  /*!< DCMIPP CSI Timer3 */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_Counter DCMIPP CSI Counter
  * @{
  */
#define DCMIPP_CSI_COUNTER0 0U /*!< DCMIPP CSI Counter 0 */
#define DCMIPP_CSI_COUNTER1 1U /*!< DCMIPP CSI Counter 1 */
#define DCMIPP_CSI_COUNTER2 2U /*!< DCMIPP CSI Counter 2 */
#define DCMIPP_CSI_COUNTER3 3U /*!< DCMIPP CSI Counter 3 */
/**
  * @}
  */
/**
  * @defgroup DCMIPP_CSI_PHY_BitRate DCMIPP CSI PHY BitRate
  * @{
  */
#define DCMIPP_CSI_PHY_BT_80      0U     /*!< PHY BitRate 80      */
#define DCMIPP_CSI_PHY_BT_90      1U     /*!< PHY BitRate 90      */
#define DCMIPP_CSI_PHY_BT_100     2U     /*!< PHY BitRate 100     */
#define DCMIPP_CSI_PHY_BT_110     3U     /*!< PHY BitRate 110     */
#define DCMIPP_CSI_PHY_BT_120     4U     /*!< PHY BitRate 120     */
#define DCMIPP_CSI_PHY_BT_130     5U     /*!< PHY BitRate 130     */
#define DCMIPP_CSI_PHY_BT_140     6U     /*!< PHY BitRate 140     */
#define DCMIPP_CSI_PHY_BT_150     7U     /*!< PHY BitRate 150     */
#define DCMIPP_CSI_PHY_BT_160     8U     /*!< PHY BitRate 160     */
#define DCMIPP_CSI_PHY_BT_170     9U     /*!< PHY BitRate 170     */
#define DCMIPP_CSI_PHY_BT_180     10U    /*!< PHY BitRate 180     */
#define DCMIPP_CSI_PHY_BT_190     11U    /*!< PHY BitRate 190     */
#define DCMIPP_CSI_PHY_BT_205     12U    /*!< PHY BitRate 205     */
#define DCMIPP_CSI_PHY_BT_220     13U    /*!< PHY BitRate 220     */
#define DCMIPP_CSI_PHY_BT_235     14U    /*!< PHY BitRate 235     */
#define DCMIPP_CSI_PHY_BT_250     15U    /*!< PHY BitRate 250     */
#define DCMIPP_CSI_PHY_BT_275     16U    /*!< PHY BitRate 275     */
#define DCMIPP_CSI_PHY_BT_300     17U    /*!< PHY BitRate 300     */
#define DCMIPP_CSI_PHY_BT_325     18U    /*!< PHY BitRate 325     */
#define DCMIPP_CSI_PHY_BT_350     19U    /*!< PHY BitRate 350     */
#define DCMIPP_CSI_PHY_BT_400     20U    /*!< PHY BitRate 400     */
#define DCMIPP_CSI_PHY_BT_450     21U    /*!< PHY BitRate 450     */
#define DCMIPP_CSI_PHY_BT_500     22U    /*!< PHY BitRate 500     */
#define DCMIPP_CSI_PHY_BT_550     23U    /*!< PHY BitRate 550     */
#define DCMIPP_CSI_PHY_BT_600     24U    /*!< PHY BitRate 600     */
#define DCMIPP_CSI_PHY_BT_650     25U    /*!< PHY BitRate 650     */
#define DCMIPP_CSI_PHY_BT_700     26U    /*!< PHY BitRate 700     */
#define DCMIPP_CSI_PHY_BT_750     27U    /*!< PHY BitRate 750     */
#define DCMIPP_CSI_PHY_BT_800     28U    /*!< PHY BitRate 800     */
#define DCMIPP_CSI_PHY_BT_850     29U    /*!< PHY BitRate 850     */
#define DCMIPP_CSI_PHY_BT_900     30U    /*!< PHY BitRate 900     */
#define DCMIPP_CSI_PHY_BT_950     31U    /*!< PHY BitRate 950     */
#define DCMIPP_CSI_PHY_BT_1000    32U    /*!< PHY BitRate 1000    */
#define DCMIPP_CSI_PHY_BT_1050    33U    /*!< PHY BitRate 1050    */
#define DCMIPP_CSI_PHY_BT_1100    34U    /*!< PHY BitRate 1100    */
#define DCMIPP_CSI_PHY_BT_1150    35U    /*!< PHY BitRate 1150    */
#define DCMIPP_CSI_PHY_BT_1200    36U    /*!< PHY BitRate 1200    */
#define DCMIPP_CSI_PHY_BT_1250    37U    /*!< PHY BitRate 1250    */
#define DCMIPP_CSI_PHY_BT_1300    38U    /*!< PHY BitRate 1300    */
#define DCMIPP_CSI_PHY_BT_1350    39U    /*!< PHY BitRate 1350    */
#define DCMIPP_CSI_PHY_BT_1400    40U    /*!< PHY BitRate 1400    */
#define DCMIPP_CSI_PHY_BT_1450    41U    /*!< PHY BitRate 1450    */
#define DCMIPP_CSI_PHY_BT_1500    42U    /*!< PHY BitRate 1500    */
#define DCMIPP_CSI_PHY_BT_1550    43U    /*!< PHY BitRate 1550    */
#define DCMIPP_CSI_PHY_BT_1600    44U    /*!< PHY BitRate 1600    */
#define DCMIPP_CSI_PHY_BT_1650    45U    /*!< PHY BitRate 1650    */
#define DCMIPP_CSI_PHY_BT_1700    46U    /*!< PHY BitRate 1700    */
#define DCMIPP_CSI_PHY_BT_1750    47U    /*!< PHY BitRate 1750    */
#define DCMIPP_CSI_PHY_BT_1800    48U    /*!< PHY BitRate 1800    */
#define DCMIPP_CSI_PHY_BT_1850    49U    /*!< PHY BitRate 1850    */
#define DCMIPP_CSI_PHY_BT_1900    50U    /*!< PHY BitRate 1900    */
#define DCMIPP_CSI_PHY_BT_1950    51U    /*!< PHY BitRate 1950    */
#define DCMIPP_CSI_PHY_BT_2000    52U    /*!< PHY BitRate 2000    */
#define DCMIPP_CSI_PHY_BT_2050    53U    /*!< PHY BitRate 2050    */
#define DCMIPP_CSI_PHY_BT_2100    54U    /*!< PHY BitRate 2100    */
#define DCMIPP_CSI_PHY_BT_2150    55U    /*!< PHY BitRate 2150    */
#define DCMIPP_CSI_PHY_BT_2200    56U    /*!< PHY BitRate 2200    */
#define DCMIPP_CSI_PHY_BT_2250    57U    /*!< PHY BitRate 2250    */
#define DCMIPP_CSI_PHY_BT_2300    58U    /*!< PHY BitRate 2300    */
#define DCMIPP_CSI_PHY_BT_2350    59U    /*!< PHY BitRate 2350    */
#define DCMIPP_CSI_PHY_BT_2400    60U    /*!< PHY BitRate 2400    */
#define DCMIPP_CSI_PHY_BT_2450    61U    /*!< PHY BitRate 2450    */
#define DCMIPP_CSI_PHY_BT_2500    62U    /*!< PHY BitRate 2500    */
/**
  * @}
  */
#endif /* DCMIPP_CSI2_SUPPORT */

/** @defgroup DCMIPP_OutputSamplesType  DCMIPP OutputSamplesType
  * @{
  */
#define DCMIPP_CLAMP_YUV (0x0U << DCMIPP_P1CCCR_TYPE_Pos) /*!< Output samples type : Clamped to [16;235] for Y and
                                                               to [16;240] for U and V  */
#define DCMIPP_CLAMP_RGB (0x1U << DCMIPP_P1CCCR_TYPE_Pos) /*!< Output samples type:Clamped to [16;235] for R, G and B */
/**
  * @}
  */
/** @defgroup DCMIPP_Format  DCMIPP Format
  * @{
  */
#define  DCMIPP_FORMAT_BYTE             0U                               /*!< DCMIPP Format BYTE    */
#define  DCMIPP_FORMAT_YUV422          (0x1EUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format YUV422  */
#define  DCMIPP_FORMAT_RGB565          (0x22UL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RGB565  */
#define  DCMIPP_FORMAT_RGB666          (0x23UL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RGB666  */
#define  DCMIPP_FORMAT_RGB888          (0x24UL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RGB888  */
#define  DCMIPP_FORMAT_RAW8            (0x2AUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RAW8    */
#define  DCMIPP_FORMAT_RAW10           (0x2BUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RAW10   */
#define  DCMIPP_FORMAT_RAW12           (0x2CUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RAW12   */
#define  DCMIPP_FORMAT_RAW14           (0x2DUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format RAW14   */
#define  DCMIPP_FORMAT_MONOCHROME_8B   (0x4AUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format 8-bits  */
#define  DCMIPP_FORMAT_MONOCHROME_10B  (0x4BUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format 10-bits */
#define  DCMIPP_FORMAT_MONOCHROME_12B  (0x4CUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format 12-bits */
#define  DCMIPP_FORMAT_MONOCHROME_14B  (0x4DUL << DCMIPP_PRCR_FORMAT_Pos) /*!< DCMIPP Format 14-bits */
/**
  * @}
  */

/** @defgroup DCMIPP_Extended_Data_Mode  DCMIPP Extended Data Mode
  * @{
  */
#define  DCMIPP_INTERFACE_8BITS   0U                          /*!< Interface captures 8bits on every pixel clock  */
#define  DCMIPP_INTERFACE_10BITS (1UL << DCMIPP_PRCR_EDM_Pos) /*!< Interface captures 10bits on every pixel clock */
#define  DCMIPP_INTERFACE_12BITS (2UL << DCMIPP_PRCR_EDM_Pos) /*!< Interface captures 12bits on every pixel clock */
#define  DCMIPP_INTERFACE_14BITS (3UL << DCMIPP_PRCR_EDM_Pos) /*!< Interface captures 14bits on every pixel clock */
#define  DCMIPP_INTERFACE_16BITS (4UL << DCMIPP_PRCR_EDM_Pos) /*!< Interface captures 16bits on every pixel clock */
/**
  * @}
  */

/** @defgroup DCMIPP_HSYNC_Polarity DCMIPP HSYNC Polarity
  * @{
  */
#define DCMIPP_HSPOLARITY_LOW       0U                 /*!< Horizontal synchronization active Low  */
#define DCMIPP_HSPOLARITY_HIGH      DCMIPP_PRCR_HSPOL  /*!< Horizontal synchronization active High */
/**
  * @}
  */
/** @defgroup DCMIPP_VSYNC_Polarity DCMIPP VSYNC Polarity
  * @{
  */
#define DCMIPP_VSPOLARITY_LOW       0U                 /*!< Vertical synchronization active Low  */
#define DCMIPP_VSPOLARITY_HIGH      DCMIPP_PRCR_VSPOL  /*!< Vertical synchronization active High */
/**
  * @}
  */
/** @defgroup DCMIPP_PIXCK_Polarity DCMIPP PIXCK Polarity
  * @{
  */
#define DCMIPP_PCKPOLARITY_FALLING  0U                  /*!< Pixel clock active on Falling edge */
#define DCMIPP_PCKPOLARITY_RISING   DCMIPP_PRCR_PCKPOL  /*!< Pixel clock active on Rising edge  */
/**
  * @}
  */

/** @defgroup DCMIPP_Synchronization_Mode DCMIPP Synchronization Mode
  * @{
  */
#define DCMIPP_SYNCHRO_HARDWARE     0U                          /*!< Hardware Synchronization */
#define DCMIPP_SYNCHRO_EMBEDDED    DCMIPP_PRCR_ESS              /*!< Embedded Synchronization */
/**
  * @}
  */
/** @defgroup DCMIPP_SWAP_COMPONENT  DCMIPP Swap Component
  * @{
  */
#define DCMIPP_SWAP_COMPONENT_DISABLE  0U                   /*!< Disable Swap R/U and B/V */
#define DCMIPP_SWAP_COMPONENT_ENABLE   (DCMIPP_CMCR_SWAPRB) /*!< Enable Swap R/U and B/V  */
/**
  * @}
  */

