zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
/** @defgroup DCMIPP_Statistics_Extraction_Mode  DCMIPP Statistics extraction Mode
  * @{
  */
#define  DCMIPP_STAT_EXT_MODE_AVERAGE   0U                               /*!< Values of pixels are accumulated as-is */
#define  DCMIPP_STAT_EXT_MODE_BINS     (1U << DCMIPP_P1ST1CR_MODE_Pos)   /*!< Values of pixels are used to see
                                                                              if the pixel fits one of the 12 bins.*/
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Module_ID  DCMIPP Statistics Extraction Module ID
  * @{
  */
#define DCMIPP_STATEXT_MODULE1  1U /*!< Statistic Extraction Module 1 */
#define DCMIPP_STATEXT_MODULE2  2U /*!< Statistic Extraction Module 2 */
#define DCMIPP_STATEXT_MODULE3  3U /*!< Statistic Extraction Module 3 */
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Source  DCMIPP Statistics extraction Source
  * @{
  */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_R   0U                              /*!< Statistics Extraction Source : Red
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_G  (1U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Green
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_B  (2U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Blue
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_L  (3U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source :
                                                 Luminance is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_R  (4U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Red
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_G  (5U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Green
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_B  (6U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Blue
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_L  (7U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source :
                                                  Luminance is sampled after the black level calibration and exposure */
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Bins  DCMIPP Statistics extraction Bins
  * @{
  */
#define  DCMIPP_STAT_EXT_BINS_MODE_LOWER_BINS   0U                               /*!< LowerBins: Accu0 (1, 2)
                                                                                      is incremented of 256 if
                                                                                      Component <4 (<8, <16) */
#define  DCMIPP_STAT_EXT_BINS_MODE_LOWMID_BINS (1U << DCMIPP_P1ST1CR_BINS_Pos) /*!< LowMid Bins: Accu0 (1, 2)
                                                                                      is incremented of 256 if
                                                                                      Component <32 (<64, <128) */
#define  DCMIPP_STAT_EXT_BINS_MODE_UPMID_BINS  (2U << DCMIPP_P1ST1CR_BINS_Pos) /*!< UpMid Bins: Accu0 (1, 2) is
                                                                                      incremented of 256 if
                                                                                      Component >127 (>191, >224) */
#define  DCMIPP_STAT_EXT_BINS_MODE_UP_BINS     (3U << DCMIPP_P1ST1CR_BINS_Pos) /*!< UpBins: Accu0 (1, 2) is
                                                                                      incremented of 256 if
                                                                                      Component >239 (>247, >251)
                                                                                      Condition: MODE = Average */
#define  DCMIPP_STAT_EXT_AVER_MODE_ALL_PIXELS  (0U << DCMIPP_P1ST1CR_BINS_Pos) /*!< All Pixels: Accu is incremented of
                                                                                   Component, if 0 <= Component < 256 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT16     (1U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt16: Accu is incremented of
                                                                                  Component, if 16 <= Component < 240 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT32     (2U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt32: Accu is incremented of
                                                                                  Component, if 32 <= Component < 224 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT64     (3U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt64: Accu is incremented of
                                                                                  Component, if 64 <= Component < 192 */
/**
  * @}
  */

/**
  * @defgroup  DCMIPP_RAWBayer2RGB_Strength DCMIPP RAWBayer2RGB Strength
  * @{
  */
#define  DCMIPP_RAWBAYER_ALGO_NONE        0U   /*!< No edge detection, pure linear interpolation */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_3  1U   /*!< RawBayer relative algorithm strength 3       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_4  2U   /*!< RawBayer relative algorithm strength 4       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_6  3U   /*!< RawBayer relative algorithm strength 6       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_8  4U   /*!< RawBayer relative algorithm strength 8       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_12 5U   /*!< RawBayer relative algorithm strength 12      */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_16 6U   /*!< RawBayer relative algorithm strength 16      */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_24 7U   /*!< RawBayer relative algorithm strength 24      */

/**
  * @}
  */

/**
  * @defgroup  DCMIPP_RAWBayer2RGB_Type DCMIPP RAWBayer2RGB Type
  * @{
  */
#define  DCMIPP_RAWBAYER_RGGB   0U                               /*!<Raw Bayer Type RGGB */
#define  DCMIPP_RAWBAYER_GRBG  (1U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type GRBG */
#define  DCMIPP_RAWBAYER_GBRG  (2U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type GBRG */
#define  DCMIPP_RAWBAYER_BGGR  (3U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type BGGR */
/**
  * @}
  */

/** @defgroup DCMIPP_Bad_Pixel_Removal_Strength  DCMIPP Bad Pixel Removal Strength
  * @{
  */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_0  0U   /*!< The filter is fairly tolerant: only a
                                                  few pixels are declared bad, due to
                                                  their high noise */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_1  1U   /*!< Bad Pixel detection strength 1 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_2  2U   /*!< Bad Pixel detection strength 2 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_3  3U   /*!< Bad Pixel detection strength 3 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_4  4U   /*!< Bad Pixel detection strength 4 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_5  5U   /*!< Bad Pixel detection strength 5 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_6  6U   /*!< Bad Pixel detection strength 6 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_7  7U   /*!< Bad Pixel detection strength 7 */
/**
  * @}
  */
/** @defgroup DCMIPP_Multiply  DCMIPP Multiply
  * @{
  */
#define DCMIPP_MULTIPY_BY_1 0U   /*!< DCMIPP multiply R/G/B by 1 */
#define DCMIPP_MULTIPY_BY_2 1U   /*!< DCMIPP multiply R/G/B by 2 */
#define DCMIPP_MULTIPY_BY_4 2U   /*!< DCMIPP multiply R/G/B by 4 */
#define DCMIPP_MULTIPY_BY_8 3U   /*!< DCMIPP multiply R/G/B by 8 */
/**
  * @}
  */
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
/** @defgroup DCMIPP_Histogram_Vertical_Decimation  DCMIPP Histogram Vertical Decimation
  * @{
  */

#define  DCMIPP_HISTO_VDEC_NONE              (0U) /*!< All lines are transmitted, no vertical decimation               */
#define  DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_2   (1U) /*!< One line out of 2 transmitted, For Raw Bayer 2 lines out of 4   */
#define  DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_4   (2U) /*!< One line out of 4 transmitted, For Raw Bayer 2 lines out of 8   */
#define  DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_8   (3U) /*!< One line out of 8 transmitted, For Raw Bayer 2 lines out of 16  */
#define  DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_16  (4U) /*!< One line out of 16 transmitted, For Raw Bayer 2 lines out of 32 */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Horizontal_Decimation  DCMIPP Histogram Horizontal Decimation
  * @{
  */
#define  DCMIPP_HISTO_HDEC_NONE               (0U) /*!< All pixels are transmitted, no Horizontal decimation             */
#define  DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_2    (1U) /*!< One pixel out of 2 transmitted, For Raw Bayer 2 pixel out of 4   */
#define  DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_4    (2U) /*!< One pixel out of 4 transmitted, For Raw Bayer 2 pixel out of 8   */
#define  DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_8    (3U) /*!< One pixel out of 8 transmitted, For Raw Bayer 2 pixel out of 16  */
#define  DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_16   (4U) /*!< One pixel out of 16 transmitted, For Raw Bayer 2 pixel out of 32 */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Component_Selection  DCMIPP Histogram Component Selection
  * @{
  */
#define  DCMIPP_HISTO_COMP_SEL_R_R_V_128      (0U) /*!< Red or V component selection             */
#define  DCMIPP_HISTO_COMP_SEL_GR_G_Y_Y       (1U) /*!< Grey-Red, Green or Y component selection */
#define  DCMIPP_HISTO_COMP_SEL_B_B_U_128      (2U) /*!< Blue or U component selection            */
#define  DCMIPP_HISTO_COMP_SEL_GB_L_L_L       (3U) /*!< Grey-Blue  or L component                */
#define  DCMIPP_HISTO_COMP_SEL_ALL_FOUR       (4U) /*!< All four components selection            */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Source  DCMIPP Histogram Source
  * @{
  */
#define  DCMIPP_HISTO_SRC_AFTR_INPUT_DECIM   (0U) /*!< Histogram Source after input Decimation or before black level  */
#define  DCMIPP_HISTO_SRC_AFTR_BLK_LVL       (1U) /*!< Histogram Source after Black Level or before Exposure          */
#define  DCMIPP_HISTO_SRC_AFTR_EXPOSURE      (2U) /*!< Histogram Source after Exposure or before Demosaicing          */
#define  DCMIPP_HISTO_SRC_AFTR_DEMOSAICING   (3U) /*!< Histogram Source after Demosaicing or before Colour conversion */
#define  DCMIPP_HISTO_SRC_AFTR_CLR_CONV      (4U) /*!< Histogram Source after Colour conversion or before Contrast    */
#define  DCMIPP_HISTO_SRC_AFTR_CONTRAST      (5U) /*!< Histogram Source after Contrast or before Crop                 */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Dynamic  DCMIPP Histogram Dynamic
  * @{
  */
#define  DCMIPP_HISTO_PIX_DYN_13_TO_6   (0U) /*!< Histogram Dynamic to extract a histogram of the light pixel values      */
#define  DCMIPP_HISTO_PIX_DYN_11_TO_4   (1U) /*!< Histogram Dynamic to extract a histogram of the semi light pixel values */
#define  DCMIPP_HISTO_PIX_DYN_9_TO_2    (2U) /*!< Histogram Dynamic to extract a histogram of the semi dark pixel values  */
#define  DCMIPP_HISTO_PIX_DYN_7_TO_0    (3U) /*!< Histogram Dynamic to extract a histogram of the dark pixel values       */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Bins  DCMIPP Histogram Bins
  * @{
  */
#define  DCMIPP_HISTO_4_BINS      (0U) /*!< 4 bins per histogram   */
#define  DCMIPP_HISTO_16_BINS     (1U) /*!< 16 bins per histogram  */
#define  DCMIPP_HISTO_64_BINS     (2U) /*!< 64 bins per histogram  */
#define  DCMIPP_HISTO_256_BINS    (3U) /*!< 256 bins per histogram */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Vertical_Regions  DCMIPP Histogram Vertical Regions
  * @{
  */
#define  DCMIPP_HISTO_1_VERTICAL_REGION_PER_FRAME      (0U)   /*!< 1 vertical region per frame  */
#define  DCMIPP_HISTO_2_VERTICAL_REGIONS_PER_FRAME      (1U)  /*!< 2 vertical regions per frame  */
#define  DCMIPP_HISTO_3_VERTICAL_REGIONS_PER_FRAME      (2U)  /*!< 3 vertical regions per frame  */
#define  DCMIPP_HISTO_4_VERTICAL_REGIONS_PER_FRAME      (3U)  /*!< 4 vertical regions per frame  */
#define  DCMIPP_HISTO_5_VERTICAL_REGIONS_PER_FRAME      (4U)  /*!< 5 vertical regions per frame  */
#define  DCMIPP_HISTO_6_VERTICAL_REGIONS_PER_FRAME      (5U)  /*!< 6 vertical regions per frame  */
#define  DCMIPP_HISTO_7_VERTICAL_REGIONS_PER_FRAME      (6U)  /*!< 7 vertical regions per frame  */
#define  DCMIPP_HISTO_8_VERTICAL_REGIONS_PER_FRAME      (7U)  /*!< 8 vertical regions per frame  */
#define  DCMIPP_HISTO_9_VERTICAL_REGIONS_PER_FRAME      (8U)  /*!< 9 vertical regions per frame  */
#define  DCMIPP_HISTO_10_VERTICAL_REGIONS_PER_FRAME     (9U)  /*!< 10 vertical regions per frame */
#define  DCMIPP_HISTO_11_VERTICAL_REGIONS_PER_FRAME     (10U) /*!< 11 vertical regions per frame */
#define  DCMIPP_HISTO_12_VERTICAL_REGIONS_PER_FRAME     (11U) /*!< 12 vertical regions per frame */
#define  DCMIPP_HISTO_13_VERTICAL_REGIONS_PER_FRAME     (12U) /*!< 13 vertical regions per frame */
#define  DCMIPP_HISTO_14_VERTICAL_REGIONS_PER_FRAME     (13U) /*!< 14 vertical regions per frame */
#define  DCMIPP_HISTO_15_VERTICAL_REGIONS_PER_FRAME     (14U) /*!< 15 vertical regions per frame */
#define  DCMIPP_HISTO_16_VERTICAL_REGIONS_PER_FRAME     (15U) /*!< 16 vertical regions per frame */
/**
  * @}
  */
/** @defgroup DCMIPP_Histogram_Horizontal_Regions  DCMIPP Histogram Horizontal Regions
  * @{
  */
#define  DCMIPP_HISTO_1_HORIZONTAL_REGION_PER_FRAME      (0U)   /*!< 1 horizontal region per frame  */
#define  DCMIPP_HISTO_2_HORIZONTAL_REGIONS_PER_FRAME      (1U)  /*!< 2 horizontal regions per frame  */
#define  DCMIPP_HISTO_3_HORIZONTAL_REGIONS_PER_FRAME      (2U)  /*!< 3 horizontal regions per frame  */
#define  DCMIPP_HISTO_4_HORIZONTAL_REGIONS_PER_FRAME      (3U)  /*!< 4 horizontal regions per frame  */
#define  DCMIPP_HISTO_5_HORIZONTAL_REGIONS_PER_FRAME      (4U)  /*!< 5 horizontal regions per frame  */
#define  DCMIPP_HISTO_6_HORIZONTAL_REGIONS_PER_FRAME      (5U)  /*!< 6 horizontal regions per frame  */
#define  DCMIPP_HISTO_7_HORIZONTAL_REGIONS_PER_FRAME      (6U)  /*!< 7 horizontal regions per frame  */
#define  DCMIPP_HISTO_8_HORIZONTAL_REGIONS_PER_FRAME      (7U)  /*!< 8 horizontal regions per frame  */
#define  DCMIPP_HISTO_9_HORIZONTAL_REGIONS_PER_FRAME      (8U)  /*!< 9 horizontal regions per frame  */
#define  DCMIPP_HISTO_10_HORIZONTAL_REGIONS_PER_FRAME     (9U)  /*!< 10 horizontal regions per frame */
#define  DCMIPP_HISTO_11_HORIZONTAL_REGIONS_PER_FRAME     (10U) /*!< 11 horizontal regions per frame */
#define  DCMIPP_HISTO_12_HORIZONTAL_REGIONS_PER_FRAME     (11U) /*!< 12 horizontal regions per frame */
#define  DCMIPP_HISTO_13_HORIZONTAL_REGIONS_PER_FRAME     (12U) /*!< 13 horizontal regions per frame */
#define  DCMIPP_HISTO_14_HORIZONTAL_REGIONS_PER_FRAME     (13U) /*!< 14 horizontal regions per frame */
#define  DCMIPP_HISTO_15_HORIZONTAL_REGIONS_PER_FRAME     (14U) /*!< 15 horizontal regions per frame */
#define  DCMIPP_HISTO_16_HORIZONTAL_REGIONS_PER_FRAME     (15U) /*!< 16 horizontal regions per frame */
/**
  * @}
  */
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
/** @defgroup DCMIPP_Interrupt_Sources  DCMIPP Interrupt sources
  * @{
  */
#define DCMIPP_IT_AXI_TRANSFER_ERROR  DCMIPP_CMIER_ATXERRIE  /*!< IPPLUG AXI Transfer error interrupt        */
#define DCMIPP_IT_PARALLEL_SYNC_ERROR DCMIPP_CMIER_PRERRIE   /*!< Sync error interrupt on parallel interface */
#define DCMIPP_IT_PIPE0_FRAME         DCMIPP_CMIER_P0FRAMEIE /*!< Frame capture interrupt complete for pipe0 */
#define DCMIPP_IT_PIPE0_VSYNC         DCMIPP_CMIER_P0VSYNCIE /*!< Vertical sync interrupt for pipe0          */
#define DCMIPP_IT_PIPE0_LINE          DCMIPP_CMIER_P0LINEIE  /*!< Multiline interrupt for pipe0              */
#define DCMIPP_IT_PIPE0_LIMIT         DCMIPP_CMIER_P0LIMITIE /*!< Limit interrupt for pipe0                  */
#define DCMIPP_IT_PIPE0_OVR           DCMIPP_CMIER_P0OVRIE   /*!< Overrun interrupt for pipe0                */
#define DCMIPP_IT_PIPE1_LINE          DCMIPP_CMIER_P1LINEIE  /*!< Multiline capture interrupt for pipe1      */
#define DCMIPP_IT_PIPE1_FRAME         DCMIPP_CMIER_P1FRAMEIE /*!< Frame capture interrupt complete for pipe1 */
#define DCMIPP_IT_PIPE1_VSYNC         DCMIPP_CMIER_P1VSYNCIE /*!< Vertical sync interrupt for pipe1          */
#define DCMIPP_IT_PIPE1_OVR           DCMIPP_CMIER_P1OVRIE   /*!< Overrun interrupt for pipe1                */
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
#define DCMIPP_IT_PIPE1_STATS          DCMIPP_CMIER_STFRAMEIE   /*!< Histogram Capture interrupt for pipe1    */
#define DCMIPP_IT_PIPE1_STATS_OVR      DCMIPP_CMIER_STOVRIE     /*!< Histogram Overrun interrupt for pipe1    */
#define DCMIPP_IT_PIPE1_STATS_BAD_CFG  DCMIPP_CMIER_STBCIE      /*!< Histogram Bad Config interrupt for pipe1 */
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
#define DCMIPP_IT_PIPE2_LINE          DCMIPP_CMIER_P2LINEIE  /*!< Multiline capture interrupt for pipe2      */
#define DCMIPP_IT_PIPE2_FRAME         DCMIPP_CMIER_P2FRAMEIE /*!< Frame capture interrupt complete for pipe2 */
#define DCMIPP_IT_PIPE2_VSYNC         DCMIPP_CMIER_P2VSYNCIE /*!< Vertical synch interrupt for pipe2         */
#define DCMIPP_IT_PIPE2_OVR           DCMIPP_CMIER_P2OVRIE   /*!< Overrun interrupt for pipe2                */
/**
  * @}
  */

