zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
#define IS_DCMIPP_CSI_DATA_TYPE_FORMAT(DATA_TYPE_FORMAT) (((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP6)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP7)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP8)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP10) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP12) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP14) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP16))
#define IS_DCMIPP_CSI_DATA_CLASS(DATA_TYPE_CLASS)((DATA_TYPE_CLASS) <= 0x3FU)
#define IS_DCMIPP_CSI_COUNTER(COUNTER) (((COUNTER) == DCMIPP_CSI_COUNTER0) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER1) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER2) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER3))
#define IS_DCMIPP_CSI_LINE_COUNTER(LINE_COUNTER)((LINE_COUNTER) <= 0xFFFFU)
#define IS_DCMIPP_CSI_BYTE_COUNTER(BYTE_COUNTER)((BYTE_COUNTER) <= 0xFFFFU)

#define IS_DCMIPP_CSI_TIMER(TIMER) (((TIMER) == DCMIPP_CSI_TIMER0) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER1) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER2) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER3))
#define IS_DCMIPP_CSI_TIMER_START(TIMER_START) (((TIMER_START) == DCMIPP_CSI_TIMER_START_SOF)||\
                                                ((TIMER_START) == DCMIPP_CSI_TIMER_START_EOF))
#endif /* DCMIPP_CSI2_SUPPORT */

#define IS_DCMIPP_FRAME_RATE(FRAME_RATE) (((FRAME_RATE) == DCMIPP_FRAME_RATE_ALL)      ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_2) ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_4) ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_8))
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
#define IS_DCMIPP_CLIENT(CLIENT) (((CLIENT) == DCMIPP_CLIENT1) ||\
                                  ((CLIENT) == DCMIPP_CLIENT2) ||\
                                  ((CLIENT) == DCMIPP_CLIENT3) ||\
                                  ((CLIENT) == DCMIPP_CLIENT4) ||\
                                  ((CLIENT) == DCMIPP_CLIENT5) ||\
                                  ((CLIENT) == DCMIPP_CLIENT6))
#else
#define IS_DCMIPP_CLIENT(CLIENT) (((CLIENT) == DCMIPP_CLIENT1) ||\
                                  ((CLIENT) == DCMIPP_CLIENT2) ||\
                                  ((CLIENT) == DCMIPP_CLIENT3) ||\
                                  ((CLIENT) == DCMIPP_CLIENT4) ||\
                                  ((CLIENT) == DCMIPP_CLIENT5))
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
#define IS_DCMIPP_DPREG_END(DPREG_END) ((DPREG_END) <= 0x3FFU)
#define IS_DCMIPP_DPREG_START(DPREG_START) ((DPREG_START) <= 0x3FFU)

#define IS_DCMIPP_TPG_WIDTH(WIDTH) (((WIDTH) >= 0x00010U) && ((WIDTH) <= 0xFFFFU))
#define IS_DCMIPP_TPG_HEIGHT(HEIGHT) ((HEIGHT) <= 0x3FFFU)
#define IS_DCMIPP_TPG_VBL(VBL) (((VBL) >= 0x00010U) && ((VBL) <= 0xFFFFU))
#define IS_DCMIPP_TPG_FORMAT(FORMAT) (((FORMAT) == DCMIPP_TPG_FORMAT_YUV422)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RGB565)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RGB888)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RAW8)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RAW10)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RAW12)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_RAW14)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_MONO8)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_MONO10)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_MONO12)||\
                                      ((FORMAT) == DCMIPP_TPG_FORMAT_MONO14))
#define IS_DCMIPP_TPG_RAW_TYPE(RAW_TYPE) (((RAW_TYPE) == DCMIPP_TPG_RT_RGGB)||\
                                          ((RAW_TYPE) == DCMIPP_TPG_RT_GRBG)||\
                                          ((RAW_TYPE) == DCMIPP_TPG_RT_GBRG)||\
                                          ((RAW_TYPE) == DCMIPP_TPG_RT_BGGR))
#define IS_DCMIPP_TPG_YUV_TYPE(YUV_TYPE) (((YUV_TYPE) == DCMIPP_TPG_YT_BT601_FULL)||\
                                          ((YUV_TYPE) == DCMIPP_TPG_YT_BT709_FULL)||\
                                          ((YUV_TYPE) == DCMIPP_TPG_YT_BT601_REDUCED)||\
                                          ((YUV_TYPE) == DCMIPP_TPG_YT_BT709_REDUCED))
#define IS_DCMIPP_TPG_PATTERN(PATTERN) (((PATTERN) == DCMIPP_TPG_PATTERN_COLORBAR)||\
                                        ((PATTERN) == DCMIPP_TPG_PATTERN_SQUARE))
#define IS_DCMIPP_TPG_GREY_SCALE(GREY_SCALE) (((GREY_SCALE) == DCMIPP_TPG_GREY_SCALE_DISABLE)||\
                                              ((GREY_SCALE) == DCMIPP_TPG_GREY_SCALE_ENABLE))
#define IS_DCMIPP_TPG_LIFELINE(LIFELINE) (((LIFELINE) == DCMIPP_TPG_LIFELINE_DISABLE)||\
                                          ((LIFELINE) == DCMIPP_TPG_LIFELINE_ENABLE))

#define IS_DCMIPP_MAX_OUTSTANDING_TRANSACTIONS(OUTS_TRANS) (((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_NONE )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_2    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_3    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_4    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_5    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_6    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_7    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_8    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_9    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_10   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_11   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_12   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_13   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_14   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_15   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_16   ))


#define IS_DCMIPP_MEMORY_PAGE_SIZE(MEMORY_PAGE_SIZE) (((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_64BYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_128BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_256BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_512BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_1KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_2KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_4KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_8KBYTES))
#define IS_DCMIPP_TRAFFIC(TRAFFIC) (((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_8BYTES ) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_16BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_32BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_64BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_128BYTES))
#define IS_DCMIPP_WLRU_RATIO(WLRU_RATIO) ((WLRU_RATIO)<= 0xFU)

