zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_dcmipp.h
#define IS_DCMIPP_STAT_EXTRACTION_SOURCE(SOURCE) (((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_R) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_G) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_B) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_L) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_R) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_G) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_B) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_L))

#define IS_DCMIPP_STAT_EXTRACTION_MODE(MODE) (((MODE) == DCMIPP_STAT_EXT_MODE_AVERAGE) ||\
                                              ((MODE) == DCMIPP_STAT_EXT_MODE_BINS))

#define IS_DCMIPP_PIPE_STAT_EXTRACTION_START(START) ((START) <= 0xFFFU)
#define IS_DCMIPP_PIPE_STAT_EXTRACTION_SIZE(SIZE) ((SIZE) <= 0xFFFU)
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
#define IS_DCMIPP_HISTO_BINS(BINS)     (((BINS) ==  DCMIPP_HISTO_4_BINS) ||\
                                        ((BINS) == DCMIPP_HISTO_16_BINS) ||\
                                        ((BINS) == DCMIPP_HISTO_64_BINS) ||\
                                        ((BINS) == DCMIPP_HISTO_256_BINS))
#define IS_DCMIPP_HISTO_COMP(COMP)     (((COMP) ==  DCMIPP_HISTO_COMP_SEL_R_R_V_128) ||\
                                        ((COMP) == DCMIPP_HISTO_COMP_SEL_GR_G_Y_Y) ||\
                                        ((COMP) == DCMIPP_HISTO_COMP_SEL_B_B_U_128) ||\
                                        ((COMP) == DCMIPP_HISTO_COMP_SEL_GB_L_L_L) ||\
                                        ((COMP) == DCMIPP_HISTO_COMP_SEL_ALL_FOUR))
#define IS_DCMIPP_HISTO_HDEC(HORDEC)    (((HORDEC) ==  DCMIPP_HISTO_HDEC_NONE) ||\
                                         ((HORDEC) == DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_2) ||\
                                         ((HORDEC) == DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_4) ||\
                                         ((HORDEC) == DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_8) ||\
                                         ((HORDEC) == DCMIPP_HISTO_HDEC_1_PIXL_OUT_OF_16))
#define IS_DCMIPP_HISTO_VDEC(VERDEC)    (((VERDEC) ==  DCMIPP_HISTO_VDEC_NONE) ||\
                                         ((VERDEC) == DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_2) ||\
                                         ((VERDEC) == DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_4) ||\
                                         ((VERDEC) == DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_8) ||\
                                         ((VERDEC) == DCMIPP_HISTO_VDEC_1_LINE_OUT_OF_16))
#define IS_DCMIPP_HISTO_PXL_DYN(DYN)  (((DYN) ==  DCMIPP_HISTO_PIX_DYN_13_TO_6) ||\
                                       ((DYN) == DCMIPP_HISTO_PIX_DYN_11_TO_4) ||\
                                       ((DYN) == DCMIPP_HISTO_PIX_DYN_9_TO_2) ||\
                                       ((DYN) == DCMIPP_HISTO_PIX_DYN_7_TO_0))
#define IS_DCMIPP_HISTO_VREG(VREG)    (((VREG) == DCMIPP_HISTO_1_VERTICAL_REGION_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_2_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_3_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_4_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_5_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_6_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_7_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_8_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_9_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_10_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_11_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_12_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_13_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_14_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_15_VERTICAL_REGIONS_PER_FRAME) ||\
                                       ((VREG) == DCMIPP_HISTO_16_VERTICAL_REGIONS_PER_FRAME))
#define IS_DCMIPP_HISTO_HREG(HREG)  (((HREG) == DCMIPP_HISTO_1_HORIZONTAL_REGION_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_2_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_3_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_4_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_5_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_6_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_7_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_8_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_9_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_10_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_11_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_12_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_13_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_14_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_15_HORIZONTAL_REGIONS_PER_FRAME) ||\
                                     ((HREG) == DCMIPP_HISTO_16_HORIZONTAL_REGIONS_PER_FRAME))
#define IS_DCMIPP_HISTO_SRC(SRC)     (((SRC) == DCMIPP_HISTO_SRC_AFTR_INPUT_DECIM        ) ||\
                                      ((SRC) == DCMIPP_HISTO_SRC_AFTR_BLK_LVL            ) ||\
                                      ((SRC) == DCMIPP_HISTO_SRC_AFTR_EXPOSURE           ) ||\
                                      ((SRC) == DCMIPP_HISTO_SRC_AFTR_DEMOSAICING        ) ||\
                                      ((SRC) == DCMIPP_HISTO_SRC_AFTR_CLR_CONV           ) ||\
                                      ((SRC) == DCMIPP_HISTO_SRC_AFTR_CONTRAST           ))
#define IS_DCMIPP_HISTO_VSTART(VSTART) ((VSTART) < 0xFFFU)
#define IS_DCMIPP_HISTO_HSTART(HSTART) ((HSTART) < 0xFFFU)
#define IS_DCMIPP_HISTO_VSIZE(VSIZE)   ((VSIZE) < 0xFFFU)
#define IS_DCMIPP_HISTO_HSIZE(HSIZE)   ((HSIZE) < 0xFFFU)
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DCMIPP */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_DCMIPP_H */

